# Install guide:
# 
# $ /usr/bin/ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
# $ brew tap Homebrew/bundle
# $ brew bundle
 
 
#tap 'homebrew/cask' # Is apparently no longer needed
tap 'homebrew/cask-versions'
tap 'AdoptOpenJDK/openjdk'
tap 'common-fate/granted'
 
cask 'temurin@21'
cask 'temurin'
cask 'temurin17'
#cask 'rectangle-pro'
cask 'moom'
cask 'firefox'
#cask '1password'
cask 'slack'
cask 'jetbrains-toolbox'
cask 'intellij-idea'
#cask 'datagrip'
cask 'docker'
cask 'postman'
cask 'iterm2'
#cask 'spotify'
#cask 'alfred'
cask 'raycast'
#cask 'sublime-text'
#cask 'spotify'
cask 'kap'
cask 'contexts'
cask 'granted' # AWS tool
 
#brew 'node@18'
brew 'awscli'
brew 'openshift-cli'
brew 'redis'
brew 'git'
brew 'gradle'
brew 'zsh'
brew 'zsh-completions'
#brew 'node'
brew 'maven'
brew 'fzf'
brew 'jq'
brew 'wget'
brew 'kdiff3'
brew 'httpie'
#brew 'sdkman'
